{
  "name": "The Continent",
  "description": "The Continent is a vast land of diverse kingdoms, forests, swamps, and mountains, each with its own culture and history. Magic and monsters linger in the shadows, shaping daily life for humans, elves, dwarves, and other races. Political intrigue and war constantly reshape borders while ancient power struggles linger beneath the surface. Travelers encounter ruined castles, bustling markets, and hidden ruins as they follow the path of Geralt, a wandering monster hunter. The world feels alive, with weather, day cycles, and living characters that react to the player's choices.",
  "regions": {
    "White Orchard": {
      "name": "White Orchard",
      "description": "White Orchard is a tranquil, rolling countryside dotted with orchards, farms, and a modest village. The land is tended by humble farmers, hunters, and craftsmen who trade at the local inn. A small militia patrols the roads, keeping the area safe from wandering monsters. Seasonal festivals bring together townsfolk, merchants, and occasional travelers.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt is a tall, pale-skinned witcher with white hair and a scarred face, his eyes a striking cat-like amber. He wears worn leather armor, twin steel swords strapped to his back, and the Witcher medallion glints at his chest. As a monster hunter, he travels White Orchard to investigate a surge of drowners and a missing girl, seeking contracts and clues about a larger threat. His purpose here is to fulfill a bounty from the local magistrate and uncover the source of a spreading curse.",
          "region": "White Orchard"
        }
      }
    },
    "Royal Palace in Vizima": {
      "name": "Royal Palace in Vizima",
      "description": "The Royal Palace in Vizima stands at the heart of Temeria's capital, a city of stone walls and bustling marketplaces. Inside, the king, his courtiers, and a council of nobles conduct state affairs. Scholars, mages, and merchants mingle in the palace courts, while royal guards enforce security. The palace also houses spies and agents of the Order of the Flaming Rose.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt stands tall with white hair, scarred skin, and piercing yellow eyes, his twin swords sheathed at his side. He is a Witcher, a trained monster hunter, known for his calm demeanor and deadly skill. He has come to the Royal Palace in Vizima to investigate a string of mysterious murders and uncover a political conspiracy threatening the kingdom.",
          "region": "Royal Palace in Vizima"
        }
      }
    },
    "Velen": {
      "name": "Velen",
      "description": "Velen is a scarred, swamp‑filled region marked by ruined villages and lingering curses. Its residents are mostly peasants, refugees, and desperate farmers struggling against famine and monsters. The Bloody Baron and his family, witchers, and travelling witches also appear among the settlements. Druid circles, witch covens, and scattered bandit gangs add further complexity to the population.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt stands tall with short white hair, scarred skin, and piercing yellow eyes. He is a witcher, a professional monster hunter trained at Kaer Morhen. He has come to Velen to investigate a series of cursed village disappearances and track a fearsome swamp monster. He also searches for any clues about Ciri's whereabouts. His silver sword hangs at his side, ready for the dangers of the barren fields.",
          "region": "Velen"
        }
      }
    },
    "Novigrad": {
      "name": "Novigrad",
      "description": "Novigrad is a sprawling port city and the Republic's economic hub, alive with markets, taverns, and towering churches. Humans, elves, dwarves, and mages coexist, though tension with the Church of the Eternal Fire is constant. Criminal guilds, smugglers, and thieves operate in the shadows, while merchants and artisans dominate the streets. Scholars, priests, and political activists also shape daily life in the bustling city.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt is a tall white-haired witcher with scarred skin and cat-like eyes. He wears leather armor reinforced with steel studs, carrying two silver and steel swords on his back. As a monster hunter, he travels the bustling city of Novigrad to track a cursed beast rumored to be terrorizing its streets. He also seeks information about the missing Ciri, following rumors that she was seen near the city's underworld. His purpose is to fulfill a contract while gathering clues for his larger quest.",
          "region": "Novigrad"
        }
      }
    },
    "The Skellige Isles": {
      "name": "The Skellige Isles",
      "description": "The Skellige Isles are a rugged archipelago of cliffs, storm‑tossed seas, and dense forests governed by clan chieftains. Its people are fierce seafarers, fishermen, warriors, and bards who honor ancient gods. Clan leaders, druidic shamans, and legendary captains command respect, while taverns host songs of past battles. Traders, hunters, and occasional outsiders add to the multicultural flavor of the islands.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt is a tall, lean man with white hair, a scarred face, and striking amber eyes. He is a witcher, a professional monster hunter trained in swordplay, alchemy, and magic. He has come to the Skellige Isles to locate a missing fellow witcher and investigate rumors of a sea monster haunting the coastal villages.",
          "region": "The Skellige Isles"
        }
      }
    },
    "Kaer Morhen": {
      "name": "Kaer Morhen",
      "description": "Kaer Morhen is an ancient, snow‑capped mountain keep that serves as the witchers' stronghold and training ground. Veteran witchers, apprentices, and master Vesemir reside within its stone walls, honing their combat and alchemy skills. The keep is protected by a small cadre of hunters and scouts who patrol the surrounding wilderness. Occasionally, scholars or emissaries visit to seek the witchers' counsel.",
      "world": "The Continent",
      "characters": {
        "Geralt of Rivia": {
          "name": "Geralt of Rivia",
          "description": "Geralt stands tall, his silver hair cropped short, his scarred face half‑hidden behind a weathered visor. He is a witcher, a monster hunter trained at Kaer Morhen, wearing leather armor stamped with the wolf medallion. He returns to Kaer Morhen to train apprentices, investigate a rising drake threat, and reclaim the keep’s lost secrets.",
          "region": "Kaer Morhen"
        }
      }
    }
  }
}
