{"name": "The Continent", "description": "The Continent is a vast, war‑torn land of rolling plains, dense forests, misty swamps, and crumbling ruins. Magic and monsters linger in the shadows while kingdoms clash over power and resources. Travelers encounter bustling towns, lonely villages, and ancient stone circles that hold forgotten secrets. The harsh climate and dangerous creatures make every journey a test of skill and resolve.", "regions": {"White Orchard": {"name": "White Orchard", "description": "White Orchard is a small farming valley of rolling hills, wheat fields and a single stone keep. The land is owned by the local lord, who depends on peasants, shepherds and a few traveling merchants for income. Bandits and a cursed forest nearby provide danger for the residents. A handful of hunters, a local innkeeper, and a few soldiers make up the community.", "world": "The Continent", "MainCharacter": {"Geralt of Rivia": {"name": "Geralt of Rivia", "description": "Geralt is a tall man with a weathered face, white hair, and cat‑like yellow eyes. He wears a leather coat lined with steel studs and carries two silver swords at his hips. As a witcher, he hunts monsters for payment and information. He has come to White Orchard to investigate reports of a cursed forest creature that is terrorizing the nearby farms. He also hopes to earn a favor from the local lord by clearing the area of bandits and monsters.", "region": "White Orchard"}, "White Orchard": {"name": "White Orchard", "description": "White Orchard is a small farming valley of rolling hills, wheat fields and a single stone keep. The land is owned by the local lord, who depends on peasants, shepherds and a few traveling merchants for income. Bandits and a cursed forest nearby provide danger for the residents. A handful of hunters, a local innkeeper, and a few soldiers make up the community.", "region": "White Orchard"}}}, "Royal Palace in Vizima": {"name": "Royal Palace in Vizima", "description": "The Royal Palace in Vizima sits in the capital of Redania, a bustling city of stone streets, marketplaces, and cramped tenements. It houses the king, his court, and a large bureaucracy of scribes, guards, and diplomats. Wealthy merchants, guild members, and foreign envoys mingle in its halls, while the surrounding slums are home to beggars, thieves, and laborers. Scholars, alchemists, and mages also work in the palace’s library and laboratories.", "world": "The Continent"}, "Velen": {"name": "Velen", "description": "Velen, known as the “Swamp of Sorrows,” is a bleak region of marshes, abandoned farms, and war‑torn villages. Its people are mostly peasants, militia, and displaced refugees who survive by farming, hunting, or scavenging. Witch hunters, bandit gangs, and a few mages roam the area, while locals worship the ancient Mother Earth. Small towns host tavern keepers, healers, and craftsmen trying to stay alive amid monsters.", "world": "The Continent"}, "Novigrad": {"name": "Novigrad", "description": "Novigrad is a sprawling port city of stone towers, canals, and a massive market district. It is governed by the powerful Church of the Eternal Fire and a council of wealthy merchants. Residents include dockworkers, priests, smugglers, thieves, scholars, and a large community of non‑human minorities such as elves and dwarves. The city’s guilds, taverns, and brothels provide employment for many, while the streets are patrolled by city guards and secretive assassins.", "world": "The Continent"}, "The Skellige Isles": {"name": "The Skellige Isles", "description": "The Skellige Isles are a rugged archipelago of cliffs, fjords, and dense pine woods, ruled by a clan‑based monarchy. Its inhabitants are fierce seafarers, clan chieftains, farmers, and shipwrights who value honor and tradition. Viking‑style warriors, bounty hunters, and mystics live in coastal villages, while the capital, Kaer Trolde, hosts a king, his council, and bustling taverns. Fishermen, traders, and storytellers keep the islands’ culture alive.", "world": "The Continent"}, "Kaer Morhen": {"name": "Kaer Morhen", "description": "Kaer Morhen is an ancient, crumbling fortress high in the mountains, once a keep for the witchers of the School of the Wolf. Today it is a remote training ground where aging witchers, apprentices, and a few local hunters reside. The area is surrounded by dense forest and harsh weather, providing a harsh environment for sword practice and monster hunting. Only a handful of caretakers, healers, and veteran witchers live there, preserving the old ways.", "world": "The Continent"}}, "start": "I am Geralt of Rivia, a witcher forged in Kaer Morhen’s fire, haunted by a past that swirls around Yennefer and Ciri and hardened by countless monster hunts. I stand amid the gentle hills of White Orchard, wheat fields stretching to the stone keep while the wind carries the pine‑scented breath of the cursed forest beyond. The villagers murmur about a night‑creature stalking the woods, and my silver swords rest at my hips, ready."}